["EDELWEISS ELSS FUND - Direct Plan-Dividend Option","EDELWEISS ELSS FUND - Direct Plan-Growth Option","EDELWEISS ELSS FUND - Dividend Option","EDELWEISS ELSS FUND - Growth Option","Edelweiss Gilt Fund - Dividend Option","Edelweiss Gilt Fund - Growth Option","Edelweiss Gilt Fund -Direct Plan-Growth Option","Edelweiss Gilt Fund-Direct Plan-Bonus Option","Edelweiss Absolute Return Fund - Direct Plan-Dividend Option","Edelweiss Absolute Return Fund - Dividend Option","Edelweiss Absolute Return Fund - Growth Option","Edelweiss Absolute Return Fund -Direct Plan-Growth Option","Edelweiss Arbitrage Fund- Direct Plan- Dividend Option","Edelweiss Arbitrage Fund- Direct Plan- Growth Option","Edelweiss Arbitrage Fund- Regular Plan -Bonus Option","Edelweiss Arbitrage Fund- Regular Plan- Dividend Option","Edelweiss Arbitrage Fund- Regular Plan- Growth Option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund - Direct Plan-Dividend Option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund - Direct Plan-Growth option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund - Growth option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund -Plan B - Dividend option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund -Plan B - Growth option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund -Plan C - Dividend option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100)  Fund -Plan C - Growth option","Edelweiss Diversified Growth Equity Top 100 (E.D.G.E. Top 100) Fund - Dividend option","Edelweiss Select Midcap Fund - Direct Plan- Dividend","Edelweiss Select Midcap Fund - Direct Plan- Growth","Edelweiss Select Midcap Fund - Dividend","Edelweiss Select Midcap Fund - Growth","Edelweiss Value Opportunities Fund - Growth Option","Edelweiss Value Opportunities Fund- Plan B-Growth Option","Edelweiss Value Opportunities Fund-Direct Plan-Dividend Option","Edelweiss Value Opportunities Fund-Direct Plan-Growth Option","Edelweiss Value Opportunities Fund-Dividend","Edelweiss Value Opportunities Fund-Plan B- Dividend Option","Edelweiss Debt and Corporate Opportunities Fund - Direct Plan- Dividend Option","Edelweiss Debt and Corporate Opportunities Fund - Dividend Option","Edelweiss Debt and Corporate Opportunities Fund - Growth Option","Edelweiss Debt and Corporate Opportunities Fund- Direct Plan- Growth Option","Edelweiss Short Term Income Fund - Bonus Option","Edelweiss Short Term Income Fund - Direct Plan- Dividend Option","Edelweiss Short Term Income Fund - Direct Plan- Growth Option","Edelweiss Short Term Income Fund - Dividend Option","Edelweiss Short Term Income Fund - Growth Option","Edelweiss Short Term Income Fund - Institutional Plan - Growth Option","Edelweiss Ultra Short Term Bond Fund  - Growth Option","Edelweiss Ultra Short Term Bond Fund  -Direct Plan- Growth Option","Edelweiss Ultra Short Term Bond Fund - Daily Dividend Option","Edelweiss Ultra Short Term Bond Fund - Fortnightly Dividend Option","Edelweiss Ultra Short Term Bond Fund - Monthly Dividend Option","Edelweiss Ultra Short Term Bond Fund - Retail Plan - Daily Dividend Option","Edelweiss Ultra Short Term Bond Fund - Retail Plan - Fortnightly Dividend Option","Edelweiss Ultra Short Term Bond Fund - Retail Plan - Growth Option","Edelweiss Ultra Short Term Bond Fund - Retail Plan - Monthly Dividend Option","Edelweiss Ultra Short Term Bond Fund - Retail Plan - Weekly Dividend Option","Edelweiss Ultra Short Term Bond Fund - Weekly Dividend Option","Edelweiss Ultra Short Term Bond Fund -Direct Plan- Daily Dividend Option","Edelweiss Ultra Short Term Bond Fund -Direct Plan- Monthly Dividend Option","Edelweiss Ultra Short Term Bond Fund -Direct Plan- Weekly Dividend Option","Edelweiss Liquid Fund - Daily Dividend Option","Edelweiss Liquid Fund - Direct Plan- Monthly Dividend Option","Edelweiss Liquid Fund - Direct Plan- Weekly Dividend Option","Edelweiss Liquid Fund - Fortnightly Dividend Option","Edelweiss Liquid Fund - Growth Option","Edelweiss Liquid Fund - Monthly Dividend Option","Edelweiss Liquid Fund - Retail Plan - Daily Dividend Option","Edelweiss Liquid Fund - Retail Plan - Growth Option","Edelweiss Liquid Fund - Retail Plan - Monthly Dividend Option","Edelweiss Liquid Fund - Retail Plan - Weekly Dividend Option","Edelweiss Liquid Fund - Weekly Dividend Option","Edelweiss Liquid Fund-Direct Plan-Daily Dividend Option","Edelweiss Liquid Fund-Direct Plan-Growth Option","Edelweiss Exchange Traded Scheme- Nifty (Nifty EES)"]